app/views/clerkmenus/index.html.erb

   <ul font-size=10px>
   <% MenuCategory.all.each do |category|%>
---
SELECT "menu_categories".* FROM "menu_categories"