app/views/usermenus/index.html.erb

SELECT "menu_categories".* FROM "menu_categories"
---
   <ul font-size=10px>
   <% MenuCategory.all.each do |category|%>