app/views/usermenus/show.html.erb

            <%= form.number_field :quantity, :value => 1%>
            <% value = Cart.where(adder_id: session[:current_user_id], who: "user", item_id: item.id) %>
---
SELECT "carts".* FROM "carts" WHERE "carts"."adder_id" = $1 AND "carts"."who" = $2 AND "carts"."item_id" = $3  [["adder_id", 1], ["who", "user"], ["item_id", 1]]