app/views/carts/show.html.erb

SELECT "menu_items".* FROM "menu_items" WHERE "menu_items"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
      <li>
      <% food = MenuItem.find(item.item_id)%>