app/controllers/buyerorders_controller.rb

SELECT "orders".* FROM "orders" WHERE "orders"."buyer_id" = $1 AND "orders"."who" = $2  [["buyer_id", 1], ["who", "user"]]
---
  def show
    buyer_id = params[:id].split(' ')

    @order_lists = Order.where(buyer_id: buyer_id[1].to_i, who: buyer_id[0])