app/controllers/carts_controller.rb

  def create
    adder_id = params[:adder_id].to_i
    item_id = params[:item_id].to_i
    who = params[:who]
    quantity = params[:quantity]
    category_id = params[:category_id]
    Cart.create!(adder_id: adder_id, who: who, item_id: item_id, quantity: quantity)
---
INSERT INTO "carts" ("adder_id", "who", "item_id", "quantity", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["adder_id", 1], ["who", "user"], ["item_id", 1], ["quantity", 1], ["created_at", "2021-03-08 09:15:48.667669"], ["updated_at", "2021-03-08 09:15:48.667669"]]

  def show
    who_id = params[:id].split(" ")
    who = who_id[0]
    id = who_id[1]
    @order_lists = Cart.where(who: who, adder_id: id)
---
SELECT "carts".* FROM "carts" WHERE "carts"."who" = $1 AND "carts"."adder_id" = $2  [["who", "user"], ["adder_id", 1]]

  def destroy
    str = params[:id].split(" ")
    who = str[0]
    adder_id = str[1]
    id = str[2]
    Cart.find(id).destroy
---
DELETE FROM "carts" WHERE "carts"."id" = $1  [["id", 33]]
SELECT "carts".* FROM "carts" WHERE "carts"."id" = $1 LIMIT $2  [["id", 33], ["LIMIT", 1]]