app/controllers/clerksessions_controller.rb

  def create
    clerk = Clerk.find_by(email: params[:email])
---
SELECT "clerks".* FROM "clerks" WHERE "clerks"."email" = $1 LIMIT $2  [["email", "clerk@gmail.com"], ["LIMIT", 1]]