app/controllers/orderanalysis_controller.rb

  def index
    @order_lists = Order.all
---
SELECT "orders".* FROM "orders"