app/controllers/orders_controller.rb

  def create
    buyer_id = params[:buyer_id].to_i
    who = params[:who]
    total_price = params[:total_price].to_i
    orderitems = params[:orderitems]
    Order.create!(
      buyer_id: buyer_id,
      who: who,
      total_price: total_price,
      orderitems: orderitems,
      status: false,
      data_ordered: Date.today,
    )
---
INSERT INTO "orders" ("buyer_id", "who", "data_ordered", "status", "total_price", "created_at", "updated_at", "orderitems") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def show
    who_id = params[:id].split(" ")
    @who = who_id[0]
    @buyer_id = who_id[1]
    order_lists = Cart.where(who: @who, adder_id: @buyer_id)
    list_hashes = []
    @total_price = 0
    order_lists.each do |item|
      new_hash = {
        :item_id => item.id,
        :quantity => item.quantity,
        :price => MenuItem.find(item.item_id).price,
      }
      list_hashes.push(new_hash)
      @total_price += MenuItem.find(item.item_id).price * item.quantity
---
SELECT "carts".* FROM "carts" WHERE "carts"."who" = $1 AND "carts"."adder_id" = $2  [["who", "user"], ["adder_id", 1]]
SELECT "menu_items".* FROM "menu_items" WHERE "menu_items"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]