app/controllers/ownerorders_controller.rb

  def index
    @clerklists = Order.where(who: "clerk", status: false)
---
SELECT "orders".* FROM "orders" WHERE "orders"."who" = $1 AND "orders"."status" = $2  [["who", "clerk"], ["status", false]]

  def update
    order_id = params[:id]
    order = Order.find(order_id)
    order.status = true
    order.save
---
SELECT "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "orders" SET "status" = $1, "updated_at" = $2 WHERE "orders"."id" = $3  [["status", true], ["updated_at", "2021-03-08 10:19:42.875571"], ["id", 1]]

  def show
    order_id = params[:id]
    order = Order.find(order_id)
    @item_lists = JSON::parse(order.orderitems)
---
SELECT "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "menu_items".* FROM "menu_items" WHERE "menu_items"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]