app/controllers/ownermenus_controller.rb

  def index
    @menu_category_list = MenuCategory.all
---
SELECT "menu_categories".* FROM "menu_categories"

  def create
    category_name = params[:name]
    MenuCategory.create!(name: category_name)
---
INSERT INTO "menu_categories" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Idly"], ["created_at", "2021-03-08 06:03:35.448539"], ["updated_at", "2021-03-08 06:03:35.448539"]]

  def destroy
    category_id = params[:id].to_i
    lists = MenuItem.where(menu_category_id: category_id)
    # debugger
    lists.each do |item|
      MenuItem.find(item.id).destroy
    end
    MenuCategory.find(category_id).destroy
---
SELECT "menu_items".* FROM "menu_items" WHERE "menu_items"."menu_category_id" = $1  [["menu_category_id", 1]]
DELETE FROM "menu_categories" WHERE "menu_categories"."id" = $1  [["id", 1]]
SELECT "menu_categories".* FROM "menu_categories" WHERE "menu_categories"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]