app/controllers/ownermenuitems_controller.rb

SELECT "menu_categories".* FROM "menu_categories" WHERE "menu_categories"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "menu_items".* FROM "menu_items" WHERE "menu_items"."menu_category_id" = $1  [["menu_category_id", 2]]
---
  def show
    @category_id = params[:id]
    @current_category = MenuCategory.find(@category_id)
    @item_lists = MenuItem.where(menu_category_id: @category_id)

INSERT INTO "menu_items" ("menu_category_id", "name", "description", "price", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["menu_category_id", 2], ["name", "Idly"], ["description", "Flour Cake"], ["price", 10.0], ["created_at", "2021-03-08 06:04:17.719109"], ["updated_at", "2021-03-08 06:04:17.719109"]]
---
  def create
    # debugger
    food_name = params[:name]
    food_description = params[:description]
    food_price = params[:price].to_f
    MenuItem.create(
      name: params[:name],
      description: params[:description],
      price: params[:price].to_f,
      menu_category_id: params[:menu_category_id].to_i,
    )

DELETE FROM "menu_items" WHERE "menu_items"."id" = $1  [["id", 1]]
SELECT "menu_items".* FROM "menu_items" WHERE "menu_items"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def destroy
    ids = params[:id].split(" ")
    menu_category_id = ids[0].to_i
    item_id = ids[1].to_i
    debugger
    MenuItem.find(item_id).destroy