app/controllers/ownersessions_controller.rb

  def create
    owner = Owner.find_by(email: params[:email])
---
SELECT "owners".* FROM "owners" WHERE "owners"."email" = $1 LIMIT $2  [["email", "abc@gmail.com"], ["LIMIT", 1]]