app/controllers/usermenus_controller.rb

  def show
    category_id = params[:id]
    @item_lists = MenuItem.where(menu_category_id: category_id)
---
SELECT "menu_items".* FROM "menu_items" WHERE "menu_items"."menu_category_id" = $1  [["menu_category_id", 2]]