app/controllers/userlogin_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def current_user
    if @current_user_id
      return @current_user
    end

    current_user_id = session[:current_user_id]
    if current_user_id
      @current_user = User.find(current_user_id)