app/models/order.rb

  def first_name
    customerdata = who.eql?("user") ? User.find(buyer_id) : Clerk.find(buyer_id)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]